src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/InformationRegisters/НаличиеФайлов/НаличиеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="060b2bb4-ca03-4da9-930f-7f91f6299a35">
  <name>НаличиеФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="394b1a1c-a7ae-41b7-a346-4bac99fa567d">
    <name>ЕстьФайлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ccfe4e36-80b6-419f-8bb3-c1046203d023">
    <name>ОбъектСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
   
&НаКлиенте
Процедура проф_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	//++ Проф-ИТ, #190, Сергеев Д.Н., 18.01.2024
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда 
		Если ТекДанные.проф_КорректироовкиЗапрещены = Истина Тогда
			Элементы.СписокКонтекстноеМенюПровести.Видимость                  = Ложь;
			Элементы.СписокКонтекстноеМенюОтменаПроведения.Видимость          = Ложь;
			Элементы.СписокКонтекстноеМенюУстановитьПометкуУдаления.Видимость = Ложь; 
			
		Иначе
			Элементы.СписокКонтекстноеМенюПровести.Видимость                  = Истина;
			Элементы.СписокКонтекстноеМенюОтменаПроведения.Видимость          = Истина;
			Элементы.СписокКонтекстноеМенюУстановитьПометкуУдаления.Видимость = Истина; 
		КонецЕсли;	
		
	КонецЕсли;	
	//-- Проф-ИТ, #190, Сергеев Д.Н., 18.01.2024
	
КонецПроцедуры


&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	проф_ПереопределитьЗапросВДинамическомСписке();
	
КонецПроцедуры  

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура проф_ПереопределитьЗапросВДинамическомСписке() //++ Проф-ИТ, #190, Сергеев Д.Н., 18.01.2024
	
	Список.ТекстЗапроса = "ВЫБРАТЬ
	|	Документторо_АктОВыполненииЭтапаРабот.Ссылка КАК Ссылка,
	|	Документторо_АктОВыполненииЭтапаРабот.ПометкаУдаления КАК ПометкаУдаления,
	|	Документторо_АктОВыполненииЭтапаРабот.Номер КАК Номер,
	|	Документторо_АктОВыполненииЭтапаРабот.Дата КАК Дата,
	|	Документторо_АктОВыполненииЭтапаРабот.Проведен КАК Проведен,
	|	Документторо_АктОВыполненииЭтапаРабот.ЗавершитьРемонтныеРаботы КАК ЗавершитьРемонтныеРаботы,
	|	Документторо_АктОВыполненииЭтапаРабот.Комментарий КАК Комментарий,
	|	Документторо_АктОВыполненииЭтапаРабот.Организация КАК Организация,
	|	Документторо_АктОВыполненииЭтапаРабот.Подразделение КАК Подразделение,
	|	Документторо_АктОВыполненииЭтапаРабот.ИзМобильного КАК ИзМобильного,
	|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусСогласования,
	|	Документторо_АктОВыполненииЭтапаРабот.СпособСогласования КАК СпособСогласования,
	|	Документторо_АктОВыполненииЭтапаРабот.Ответственный КАК Ответственный,
	|	Документторо_АктОВыполненииЭтапаРабот.МоментВремени КАК МоментВремени,
	|	Документторо_АктОВыполненииЭтапаРабот.ДатыИзмененыВручную КАК ДатыИзмененыВручную,
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НаличиеФайлов.ЕстьФайлы
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьФайлы,
	|	Документторо_АктОВыполненииЭтапаРабот.ОбъектыРемонтаСтрокой КАК ОбъектыРемонтаСтрокой,
	|	Документторо_АктОВыполненииЭтапаРабот.ВидыРемонтаСтрокой КАК ВидыРемонтаСтрокой,
	|	Документторо_АктОВыполненииЭтапаРабот.проф_КорректироовкиЗапрещены КАК проф_КорректироовкиЗапрещены
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК Документторо_АктОВыполненииЭтапаРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|		ПО Документторо_АктОВыполненииЭтапаРабот.Ссылка = НаличиеФайлов.ОбъектСФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|		ПО (торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = Документторо_АктОВыполненииЭтапаРабот.Ссылка)";
	
    НовЭлемент = Элементы.Добавить("проф_КорректироовкиЗапрещены", Тип("ПолеФормы"), Элементы.Список);
	НовЭлемент.Вид	= ВидПоляФормы.ПолеФлажка;
	НовЭлемент.ПутьКДанным	= "Список.проф_КорректироовкиЗапрещены";	
	НовЭлемент.Заголовок	= " "; 
	НовЭлемент.ШиринаЭлемента = 1;
	НовЭлемент.Видимость    = Истина;   
	
КонецПроцедуры //-- Проф-ИТ, #190, Сергеев Д.Н., 18.01.2024

#КонецОбласти
